---
kind: enumMember
id: F:Autodesk.Revit.DB.TransactionStatus.Proceed
enum: Autodesk.Revit.DB.TransactionStatus
source: html/29b9a7a8-6754-8310-e063-622b569bb6d5.htm
---
# Autodesk.Revit.DB.TransactionStatus.Proceed

while still in error handling (internal status)